In [1]:
# importamos las librerías que necesitamos

# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np


# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames
pd.set_option('display.max_colwidth', None) # para visualizar todo el contenido de los valores
#pd.set_option('display.max_rows', None) # Para visualizar todo el contenido de las filas

In [2]:
datos = pd.read_csv('Datos/datos_empresa.csv', index_col=0)
datos_limpios = pd.read_csv('Datos/datos_empresa_V1.csv', index_col=0)

In [3]:
#Creamos Dataframe de las columnas de los df a comparar

datos_col = pd.DataFrame(list(datos.columns), columns=['datos'])
datos_col
datos_limpio_col = pd.DataFrame(list(datos_limpios.columns), columns=['datos2'])
datos_limpio_col

                      datos2
0                        Age
1                  Attrition
2             BusinessTravel
3                  DailyRate
4                 Department
5           DistanceFromHome
6                  Education
7             EducationField
8             employeenumber
9    EnvironmentSatisfaction
10                    Gender
11                HourlyRate
12            JobInvolvement
13                  JobLevel
14                   JobRole
15           JobSatisfaction
16             MaritalStatus
17             MonthlyIncome
18               MonthlyRate
19        NUMCOMPANIESWORKED
20                  OverTime
21         PercentSalaryHike
22         PerformanceRating
23  RelationshipSatisfaction
24             StandardHours
25          StockOptionLevel
26         TOTALWORKINGYEARS
27     TrainingTimesLastYear
28           WORKLIFEBALANCE
29            YearsAtCompany
30        YearsInCurrentRole
31   YearsSinceLastPromotion
32      YEARSWITHCURRMANAGER
33                 DateBirth
34                RemoteWork

In [4]:
# mergeamos las columnas para saber si tenemos duplicados

df_merge = datos_col.merge(datos_limpio_col, left_on='datos', right_on='datos2', how = 'left')
df_merge

                       datos                    datos2
0                        Age                       Age
1                  Attrition                 Attrition
2             BusinessTravel            BusinessTravel
3                  DailyRate                 DailyRate
4                 Department                Department
5           DistanceFromHome          DistanceFromHome
6                  Education                 Education
7             EducationField            EducationField
8              employeecount                       NaN
9             employeenumber            employeenumber
10   EnvironmentSatisfaction   EnvironmentSatisfaction
11                    Gender                    Gender
12                HourlyRate                HourlyRate
13            JobInvolvement            JobInvolvement
14                  JobLevel                  JobLevel
15                   JobRole                   JobRole
16           JobSatisfaction           JobSatisfaction
17             MaritalStatus             MaritalStatus
18             MonthlyIncome             MonthlyIncome
19               MonthlyRate               MonthlyRate
20        NUMCOMPANIESWORKED        NUMCOMPANIESWORKED
21                    Over18                       NaN
22                  OverTime                  OverTime
23         PercentSalaryHike         PercentSalaryHike
24         PerformanceRating         PerformanceRating
25  RelationshipSatisfaction  RelationshipSatisfaction
26             StandardHours             StandardHours
27          StockOptionLevel          StockOptionLevel
28         TOTALWORKINGYEARS         TOTALWORKINGYEARS
29     TrainingTimesLastYear     TrainingTimesLastYear
30           WORKLIFEBALANCE           WORKLIFEBALANCE
31            YearsAtCompany            YearsAtCompany
32        YearsInCurrentRole        YearsInCurrentRole
33   YearsSinceLastPromotion   YearsSinceLastPromotion
34      YEARSWITHCURRMANAGER      YEARSWITHCURRMANAGER
35       SameAsMonthlyIncome                       NaN
36                 DateBirth                 DateBirth
37                    Salary                       NaN
38           RoleDepartament                       NaN
39            NUMBERCHILDREN                       NaN
40                RemoteWork                RemoteWork

In [5]:
#filtro para saber columnas que habíamos borrado

filtro = df_merge['datos2'].isna()
df_filtro = df_merge[filtro]

df_filtro

                  datos datos2
8         employeecount    NaN
21               Over18    NaN
35  SameAsMonthlyIncome    NaN
37               Salary    NaN
38      RoleDepartament    NaN
39       NUMBERCHILDREN    NaN

In [6]:
comparacion = df_merge['datos'] == df_merge['datos2']
comparacion

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8     False
9      True
10     True
11     True
12     True
13     True
14     True
15     True
16     True
17     True
18     True
19     True
20     True
21    False
22     True
23     True
24     True
25     True
26     True
27     True
28     True
29     True
30     True
31     True
32     True
33     True
34     True
35    False
36     True
37    False
38    False
39    False
40     True
dtype: bool

In [7]:
#borramos columnas que no necesitamos

datos.drop( columns = ['employeecount','Over18','SameAsMonthlyIncome', 'Salary', 'RoleDepartament', 'NUMBERCHILDREN'], inplace= True)

In [8]:
# transformamos columnas para su mejor visulatización las convertimos todos a lower

new_columns = {column : column.lower() for column in datos}

new_columns

datos.rename(columns = new_columns, inplace= True)

datos.head()

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,datebirth,remotework
0,51,No,NaN,"684,0$",NaN,6,3,NaN,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,1972,Yes
1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,"259,0",3,0,65,2,5,ManAGeR,3,NaN,"19999,0",5678,0,NaN,14,"3,0",1,NaN,1,"34,0",5,"3,0",33,NaN,11,9,1971,1
2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,"319,0",3,0,58,3,5,ManaGER,4,Married,"19232,0",4933,1,No,11,"3,0",4,NaN,0,"22,0",3,NaN,22,NaN,11,15,1981,1
3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,NaN,1,1,82,3,4,ReseArCH DIrECtOr,3,Married,"17169,0",26703,3,NaN,19,"3,0",2,NaN,2,NaN,2,NaN,20,NaN,5,6,1976,False
4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,NaN,1,1,45,4,4,sAleS EXECUtIve,1,Divorced,NaN,7739,2,No,12,"3,0",4,NaN,1,NaN,5,"3,0",19,NaN,2,8,1977,0

In [9]:
# Transformamos columnas

In [10]:
datos['age'].unique()

age = datos['age'].str.replace('fifty-eight', '58 ').str.replace('fifty-eight', '47 ').str.replace('thirty-six', '36').str.replace('fifty-five', '55').str.replace('fifty-two', '52').str.replace('thirty-one', '31').str.replace('twenty-six', '36').str.replace('thirty-seven', '37').str.replace('thirty-seven', '37').str.replace('thirty-two', '32').str.replace('twenty-four', '24').str.replace('forty-seven', '47').str.replace('thirty', '30')

datos['age'] = age

datos['age'].unique()

array(['51', '52', '42', '47', '46', '48', '59', '41', '56', '38', '55',
       '40', '58', '35', '45', '33', '36', '34', '53', '43', '60', '32',
       '37', '49', '39', '50', '44', '30', '58 ', '29', '31', '54', '57',
       '27', '28', '26', '25', '24', '23', '22', '21', '20', '19', '18'],
      dtype=object)

In [11]:
datos['attrition'].unique()

array(['No', 'Yes'], dtype=object)

In [12]:
businesstravel = datos['businesstravel'].str.replace('_', ' ').str.replace('-', ' ').str.capitalize()

datos['businesstravel'] = businesstravel

datos['businesstravel'].unique()

array([nan, 'Travel rarely', 'Travel frequently', 'Non travel'],
      dtype=object)

In [13]:
# nos falta ver qué hacemos con los Nan y convertirlo en INT. Llego hasta numcompaniesworked

dailyrate = datos['dailyrate'].str.replace('$', '')


datos['dailyrate'] = dailyrate

datos['dailyrate'] 

datos['businesstravel'].unique()

array([nan, 'Travel rarely', 'Travel frequently', 'Non travel'],
      dtype=object)

In [14]:
# ver qué hacemos con los Nan

datos['department'].unique()

array([nan, ' Research & Development ', ' Sales ', ' Human Resources '],
      dtype=object)

In [38]:
# Hemos cambiado el tipo de int a str y elominado el menos de los negativos. Queda vovlerlo float.

datos_distance = datos['distancefromhome'].astype(str)

distancefromhome = datos_distance.str.replace('-', '')

datos['distancefromhome'] = distancefromhome

datos['distancefromhome'].unique()

array(['6', '1', '4', '2', '3', '22', '25', '9', '7', '23', '10', '12',
       '14', '13', '15', '8', '42', '28', '37', '5', '16', '35', '26',
       '24', '29', '17', '21', '18', '30', '27', '20', '31', '39', '11',
       '19', '33', '34', '46', '36', '45', '47', '32', '41', '49', '48',
       '38', '43', '40', '44'], dtype=object)

In [16]:
datos.head(1) # Llego hasta numcompaniesworked

,age,attrition,businesstravel,dailyrate,department,distancefromhome,education,educationfield,employeenumber,environmentsatisfaction,gender,hourlyrate,jobinvolvement,joblevel,jobrole,jobsatisfaction,maritalstatus,monthlyincome,monthlyrate,numcompaniesworked,overtime,percentsalaryhike,performancerating,relationshipsatisfaction,standardhours,stockoptionlevel,totalworkingyears,trainingtimeslastyear,worklifebalance,yearsatcompany,yearsincurrentrole,yearssincelastpromotion,yearswithcurrmanager,datebirth,remotework
0,51,No,NaN,"684,0",NaN,6,3,NaN,"162,0",1,0,51,3,5,resEArch DIREcToR,3,NaN,"19537,0",6462,7,No,13,"3,0",3,NaN,0,NaN,5,"3,0",20,NaN,15,15,1972,Yes

In [17]:
datos['education'].unique() # No hay que hacerle nada

array([3, 4, 2, 1, 5])

In [18]:
datos['educationfield'].unique() # ya está capitalizado. Nos falta ver que hacer con NaN

array([nan, 'Life Sciences', 'Technical Degree', 'Medical', 'Other',
       'Marketing', 'Human Resources'], dtype=object)

In [19]:
datos['employeenumber'].unique() # tiene NaN. Tiene duplicados

array(['162,0', '259,0', '319,0', ..., '2012,0', '2023,0', '2040,0'],
      dtype=object)

In [20]:
datos['environmentsatisfaction'].unique()

array([ 1,  3,  4,  2, 42, 37, 35, 25, 27, 31, 39, 21, 15, 14, 33, 19, 12,
       13, 28, 47, 36, 29, 24, 46, 16, 22, 41, 49, 11, 48, 18, 10, 45, 38,
       17, 20, 26, 43])

In [21]:
datos['gender'].unique() # ¿queremos cambiar los 0 y uno por las iniciales del genero?

array([0, 1])

In [22]:
datos['hourlyrate'].unique() # pasar a int y antes cambiar el Not Avaiable a NaN

array(['51', '65', '58', '82', '45', '99', '91', '64', '55', '68', '49',
       '61', '79', '31', '69', '48', '80', '74', '98', '59', '33', '56',
       '66', '57', '53', '87', '81', '84', '32', '41', '92', '47',
       'Not Available', '43', '86', '30', '42', '88', '96', '67', '62',
       '72', '78', '89', '52', '50', '90', '37', '94', '76', '60', '46',
       '83', '100', '40', '97', '54', '75', '39', '85', '63', '44', '93',
       '36', '35', '73', '71', '70', '38', '77', '95', '34'], dtype=object)

In [23]:
datos['jobinvolvement'].unique() # no tocar

array([3, 2, 4, 1])

In [24]:
datos['joblevel'].unique() # no tocar

array([5, 4, 3, 2, 1])

In [25]:
# Todo pasado a minusculas, dejando la primera en mayusculas y eliminando los espacios que habia al inicio y final
datos['jobrole'] = datos['jobrole'].str.lower().str.title().str.strip()
datos['jobrole'].unique()

array(['Research Director', 'Manager', 'Sales Executive',
       'Manufacturing Director', 'Research Scientist',
       'Healthcare Representative', 'Laboratory Technician',
       'Sales Representative', 'Human Resources'], dtype=object)

In [26]:
datos['jobsatisfaction'].unique() # no tocar

array([3, 4, 1, 2])

In [27]:
# Sustituyo los que están mal escritos para que sean iguales a los que si creando un diccionario previamente.
replacements = {
    'divorced': 'Divorced',
    'Marreid': 'Married'
}

datos['maritalstatus'] = datos['maritalstatus'].replace(replacements)
datos['maritalstatus'].unique()

array([nan, 'Married', 'Divorced', 'Single'], dtype=object)

In [28]:
datos['monthlyincome'].unique() # Tiene nan, hay que cambiarlo a NaN y pasarlo a float

array(['19537,0', '19999,0', '19232,0', '17169,0', nan, '17174,0',
       '16595,0', '19973,0', '13402,0', '13206,0', '19545,0', '18041,0',
       '19246,0', '10748,0', '16752,0', '6201,0', '19845,0', '4001,0',
       '10447,0', '16064,0', '3210,0', '10266,0', '10475,0', '6162,0',
       '4721,0', '4615,0', '16959,0', '10306,0', '5406,0', '5902,0',
       '10855,0', '5914,0', '6646,0', '13973,0', '13320,0', '6687,0',
       '4735,0', '13872,0', '19045,0', '16015,0', '9613,0', '11510,0',
       '4306,0', '17046,0', '5067,0', '3692,0', '19847,0', '2308,0',
       '5747,0', '10422,0', '6347,0', '2348,0', '3072,0', '12490,0',
       '8020,0', '17068,0', '8943,0', '19272,0', '5577,0', '2691,0',
       '7403,0', '8823,0', '3579,0', '17779,0', '18213,0', '13577,0',
       '19190,0', '17123,0', '19187,0', '10008,0', '7988,0', '7083,0',
       '4723,0', '3407,0', '2929,0', '12031,0', '15427,0', '5126,0',
       '9619,0', '5010,0', '19033,0', '10400,0', '2793,0', '5674,0',
       '19197,0', '8412,0', '3348,0', '5309,0', '7654,0', '12808,0',
       '6586,0', '2519,0', '17099,0', '13120,0', '3131,0', '4444,0',
       '6674,0', '9852,0', '17861,0', '7446,0', '13757,0', '16598,0',
       '4285,0', '10124,0', '9714,0', '9924,0', '11245,0', '3069,0',
       '9241,0', '6472,0', '3055,0', '8321,0', '3143,0', '8578,0',
       '4197,0', '9888,0', '13341,0', '5677,0', '2909,0', '9526,0',
       '6825,0', '4424,0', '5441,0', '6074,0', '6146,0', '6172,0',
       '4668,0', '5605,0', '4319,0', '3564,0', '6261,0', '6804,0',
       '19436,0', '5828,0', '2455,0', '5055,0', '4682,0', '5257,0',
       '2119,0', '5974,0', '3034,0', '13212,0', '8392,0', '4051,0',
       '4805,0', '2741,0', '5337,0', '9434,0', '5396,0', '11159,0',
       '4960,0', '8793,0', '19189,0', '2216,0', '11713,0', '5304,0',
       '11103,0', '6632,0', '7587,0', '4335,0', '5980,0', '4244,0',
       '5228,0', '2700,0', '2366,0', '2329,0', '4294,0', '6725,0',
       '10325,0', '4447,0', '10845,0', '5472,0', '6385,0', '7525,0',
       '3660,0', '8740,0', '13499,0', '3491,0', '5220,0', '10252,0',
       '19740,0', '6209,0', '7094,0', '4534,0', '8500,0', '4639,0',
       '5363,0', '4081,0', '3578,0', '17328,0', '10793,0', '10851,0',
       '10466,0', '2362,0', '6439,0', '5769,0', '4385,0', '4066,0',
       '5206,0', '2655,0', '2570,0', '4502,0', '4968,0', '5147,0',
       '2718,0', '3539,0', '5468,0', '5813,0', '9667,0', '5154,0',
       '5675,0', '7314,0', '5098,0', '13570,0', '6712,0', '9991,0',
       '10248,0', '10938,0', '2593,0', '11878,0', '8095,0', '16856,0',
       '4537,0', '17924,0', '4014,0', '12742,0', '3376,0', '10482,0',
       '4249,0', '6549,0', '14411,0', '19586,0', '8237,0', '3211,0',
       '16704,0', '4774,0', '4568,0', '5993,0', '6499,0', '3452,0',
       '6397,0', '2725,0', '3622,0', '6180,0', '6274,0', '4381,0',
       '2559,0', '5488,0', '2514,0', '3196,0', '3420,0', '4087,0',
       '5368,0', '12936,0', '4221,0', '4963,0', '4200,0', '5006,0',
       '7639,0', '6502,0', '13525,0', '6349,0', '6380,0', '3102,0',
       '4556,0', '4230,0', '4859,0', '6322,0', '10761,0', '2973,0',
       '5204,0', '17399,0', '16885,0', '4323,0', '5155,0', '2936,0',
       '18789,0', '4883,0', '2029,0', '2996,0', '9278,0', '4162,0',
       '8853,0', '4876,0', '2141,0', '7756,0', '3936,0', '6842,0',
       '3989,0', '4930,0', '3702,0', '2705,0', '4448,0', '2379,0',
       '5487,0', '2810,0', '8938,0', '9936,0', '5454,0', '18740,0',
       '5473,0', '13503,0', '13549,0', '18172,0', '2774,0', '9439,0',
       '5265,0', '3815,0', '2389,0', '4000,0', '17584,0', '5661,0',
       '4869,0', '4649,0', '10496,0', '2768,0', '3408,0', '3755,0',
       '2187,0', '4258,0', '5326,0', '5485,0', '2782,0', '17639,0',
       '6062,0', '6288,0', '3424,0', '4194,0', '2532,0', '5666,0',
       '13726,0', '4107,0', '3597,0', '4115,0', '6272,0', '2517,0',
       '3904,0', '9204,0', '4373,0', '2064,0', '2430,0', '4877,0',
       '3760,0', '2013,0', '2974,0', '2766,0', '3377,0', '4213,0',
       '6513,0', '4284,0', '2226,0', '5561,0', '2144,0', '5373,0',
       '2897,0', '5321,0', '5410,0', '4850,0', '2001,0', '4404,0',
       '3944,0', '2960,0', '18947,0', '6465,0', '2683,0', '2014,0',
       '3441,0', '13664,0', '5021,0', '18844,0', '4739,0', '10650,0',
       '4317,0', '2024,0', '3058,0', '3929,0', '4425,0', '2328,0',
       '2657,0', '5940,0', '2622,0', '3212,0', '2911,0', '6931,0',
       '2176,0', '3230,0', '18665,0', '2789,0', '6410,0', '4941,0',
       '3983,0', '2904,0', '2696,0', '2174,0', '6755,0', '10965,0',
       '2543,0', '19406,0', '6538,0', '2258,0', '2218,0', '2654,0',
       '11935,0', '2546,0', '3894,0', '4262,0', '10527,0', '2400,0',
       '3681,0', '3447,0', '19513,0', '2659,0', '8847,0', '2045,0',
       '4851,0', '8120,0', '4577,0', '5405,0', '3708,0', '13770,0',
       '2297,0', '2450,0', '4342,0', '2572,0', '6500,0', '3149,0',
       '5324,0', '4382,0', '2553,0', '5933,0', '4403,0', '10934,0',
       '2022,0', '4256,0', '3580,0', '2899,0', '5562,0', '2377,0',
       '2404,0', '2799,0', '2811,0', '4377,0', '4240,0', '4227,0',
       '3917,0', '4969,0', '2042,0', '2821,0', '9957,0', '2207,0',
       '2070,0', '2791,0', '8224,0', '2610,0', '5731,0', '2539,0',
       '2376,0', '19081,0', '2743,0', '4538,0', '3867,0', '2080,0',
       '2096,0', '4627,0', '2302,0', '5071,0', '10596,0', '5467,0',
       '2394,0', '3629,0', '9362,0', '3229,0', '16422,0', '5647,0',
       '4400,0', '2066,0', '5486,0', '3162,0', '6651,0', '4898,0',
       '3180,0', '11244,0', '4069,0', '6392,0', '4855,0', '3312,0',
       '3117,0', '15202,0', '2580,0', '2166,0', '4374,0', '5505,0',
       '2587,0', '15972,0', '2305,0', '3433,0', '3477,0', '3907,0',
       '3445,0', '2760,0', '6294,0', '13116,0', '3591,0', '2105,0',
       '3902,0', '2662,0', '2062,0', '5507,0', '8103,0', '3978,0',
       '5399,0', '10448,0', '4440,0', '2660,0', '3375,0', '2269,0',
       '4787,0', '2809,0', '10854,0', '2571,0', '6142,0', '2496,0',
       '3419,0', '2501,0', '2566,0', '3920,0', '13964,0', '6540,0',
       '2244,0', '16184,0', '4233,0', '14814,0', '17159,0', '2318,0',
       '3617,0', '2684,0', '19237,0', '4422,0', '2552,0', '2678,0',
       '5171,0', '11916,0', '9380,0', '5878,0', '2468,0', '4127,0',
       '2148,0', '3886,0', '6667,0', '2090,0', '2086,0', '1951,0',
       '3022,0', '9724,0', '3388,0', '3038,0', '2322,0', '2926,0',
       '4505,0', '2835,0', '6553,0', '6673,0', '13591,0', '2177,0',
       '19517,0', '19202,0', '10048,0', '2723,0', '6644,0', '3161,0',
       '1420,0', '1200,0', '5238,0', '9985,0', '15992,0', '2370,0',
       '6781,0', '6653,0', '2851,0', '5258,0', '2476,0', '2285,0',
       '3448,0', '4558,0', '1702,0', '2564,0', '5070,0', '3780,0',
       '9824,0', '1878,0', '2340,0', '2127,0', '2033,0', '9602,0',
       '16627,0', '2083,0', '1009,0', '7861,0', '2642,0', '5121,0',
       '2694,0', '5094,0', '2274,0', '2314,0', '2380,0', '2008,0',
       '10552,0', '2259,0', '2413,0', '2121,0', '2479,0', '13194,0',
       '4163,0', '2600,0', '18303,0', '4777,0', '1052,0', '2461,0',
       '2596,0', '4728,0', '7351,0', '4766,0', '2827,0', '2853,0',
       '2290,0', '2107,0', '2210,0', '13191,0', '18265,0', '1118,0',
       '2372,0', '2838,0', '18061,0', '1611,0', '4768,0', '1274,0',
       '2561,0', '1563,0', '6388,0', '8376,0', '4841,0', '2074,0',
       '2972,0', '6815,0', '2690,0', '17567,0', '1569,0', '4187,0',
       '3306,0', '1393,0', '10883,0', '2862,0', '6735,0', '9756,0',
       '5294,0', '2437,0', '4071,0', '2956,0', '4648,0', '2804,0',
       '2439,0', '2856,0', '2933,0', '1091,0', '5151,0', '2863,0',
       '2858,0', '1129,0', '19431,0'], dtype=object)

In [29]:
datos['monthlyrate'].unique() # no tocar

array([ 6462,  5678,  4933, ..., 15302, 26956, 16642])

In [30]:
datos['numcompaniesworked'].unique() # no tocar

array([7, 0, 1, 3, 2, 4, 8, 9, 5, 6])

In [ ]:
# Función para convertir la coma en punto y los objet a float

columns = ['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement',
       'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus',
       'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'overtime',
       'percentsalaryhike', 'performancerating', 'relationshipsatisfaction',
       'standardhours', 'stockoptionlevel', 'totalworkingyears',
       'trainingtimeslastyear', 'worklifebalance', 'yearsatcompany',
       'yearsincurrentrole', 'yearssincelastpromotion', 'yearswithcurrmanager',
       'datebirth', 'remotework']

performancerating = datos['performancerating'].str.replace(',', '.')

datos['performancerating'] = performancerating
datos['performancerating']

In [32]:
datos.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeenumber',
       'environmentsatisfaction', 'gender', 'hourlyrate', 'jobinvolvement',
       'joblevel', 'jobrole', 'jobsatisfaction', 'maritalstatus',
       'monthlyincome', 'monthlyrate', 'numcompaniesworked', 'overtime',
       'percentsalaryhike', 'performancerating', 'relationshipsatisfaction',
       'standardhours', 'stockoptionlevel', 'totalworkingyears',
       'trainingtimeslastyear', 'worklifebalance', 'yearsatcompany',
       'yearsincurrentrole', 'yearssincelastpromotion', 'yearswithcurrmanager',
       'datebirth', 'remotework'],
      dtype='object')